using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace EU2012.Common.BhEnum {
    public enum ProjectLog : int{
            建立專案 = 100,
            轉檔開始 = 200,
            結束轉檔 = 300,
            更新寄送名單 = 400,
            觸發審核 = 500,
            抽檢抽件 = 510,
            抽檢抽件放行 = 511,
            抽檢抽件作廢 = 512,
            層簽 = 520,
            核可 = 521,
            不核可 = 522,
            會簽 = 530,
            不需核可 = 540,
            轉檔完成後即刻寄送 = 550,
            平行簽 = 560,
            結束轉檔作業 = 600,
            審核中 = 650,
            自動退件重發 = 700,
            手動退件重發 = 710,
            取消退件重發 = 720,
            專案準備中 = 750,
            專案制檔開始 = 751,
            專案開始寄送 = 752,
            專案寄送完成 = 800,
            專案自動結案 = 850,
            專案手動結案 = 860,
            使用者中斷 = 1000,
            使用者強制中斷 = 1001,
            中斷完成 = 1002,
            自定事件 = 99999
    }
}
